function setup() {
  createCanvas(500, 700);
}

function draw() {
  // 배경벽
  background(235, 229, 219);

  //오른쪽 모서리 벽
  noStroke();
  fill(214, 206, 192);
  quad(360, 0, 500, 0, 500, 620, 385, 700);

  //원목 테이블
  noStroke();
  fill(178, 133, 80);
  rect(0, 430, 500, 270);

 

  //아이스 라떼
  fill(200, 171, 132, 235);
  rect(183, 365, 134, 267);

  //얼음 조각
  fill(255, 255, 255, 90);
  rect(200, 370, 32, 32);
  rect(238, 380, 30, 30);

  //빨대
  fill(255, 255, 255, 120);
  stroke(220, 220, 224);
  rect(245, 235, 10, 200);
  noStroke();

  //유리컵 테두리
  noFill();
  stroke(255, 255, 255, 150);
  rect(175, 330, 150, 310);

  //컵 입구
  noStroke();
  fill(213, 189, 158, 200);
  ellipse(250, 330, 150, 16);

}
